align_smart_goals_api/app/controllers/users_controller.rb

  def login
    user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jennifer"], ["LIMIT", 1]]